// Вывести квадрат числа
Console.WriteLine("Введите число");
int n = int.Parse(Console.ReadLine());
Console.Write("Квадрат числа " + n + " равен " + n*n);